johnnyclem/neon-link/sdkconfig.defaults.linksync-p4lcd
# link-sync on Elecrow CrowPanel Advance 5.0" ESP32-P4 (800×480 RGB).
# Isolated build — do not overwrite the S3 / e-paper sdkconfig:
#   . ~/esp/esp-idf-v5.5.5/export.sh
#   idf.py -B build-linksync-p4lcd -DSDKCONFIG=build-linksync-p4lcd/sdkconfig \
#     -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.linksync-p4lcd" \
#     set-target esp32p4 build
# See docs/LINKSYNC_P4LCD.md.

CONFIG_IDF_TARGET="esp32p4"
CONFIG_NEON_BOARD_LINKSYNC_P4LCD=y
# CONFIG_NEON_BOARD_CUSTOM is not set
# CONFIG_NEON_BOARD_AMYBOARD is not set
# CONFIG_NEON_BOARD_P4DEVKIT is not set
# CONFIG_NEON_BOARD_LINKSYNC is not set
# CONFIG_NEON_BOARD_LINKSYNC_EPD is not set
# CONFIG_NEON_AUDIO is not set

# This CrowPanel is P4 rev v1.3. IDF 5.5 defaults to v3.1+ and will
# refuse to flash (or brick) a v1.3 part unless this pair is set.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16mb.csv"

# 32 MB HEX PSRAM. 200 MHz is what Elecrow ships; needed for 800×480 RGB.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# CH343 USB-UART on the UART Type-C (GPIO 37/38). Not native USB-JTAG.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set

CONFIG_UART_ISR_IN_IRAM=y

# No RJ45 on this HMI. EMAC pins collide with the C6 SDIO map.
# Keep SPI-ETH Kconfig so esp_eth.h still exists; CS is -1 so it stays idle.
# CONFIG_ETH_USE_ESP32_EMAC is not set

# C6 coprocessor. SDIO map is CrowPanel, not Waveshare Function-EV.
# CONFIG_ESP_HOST_WIFI_ENABLED is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_WIFI_RMT_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=20
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=54
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=53
CONFIG_ESP_HOSTED_SDIO_PIN_D0=52
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=51
CONFIG_ESP_HOSTED_SDIO_PIN_D2=50
CONFIG_ESP_HOSTED_SDIO_PIN_D3=49
CONFIG_ESP_HOSTED_SDIO_PIN_D1=51

# No on-chip BLE. SoftAP is the provision path.
# CONFIG_BT_ENABLED is not set
# CONFIG_BT_NIMBLE_ENABLED is not set
# CONFIG_ESP_COEX_SW_COEXIST_ENABLE is not set
